{
  "version": "1.0.0",
  "messages": [
    {
      "id": "AMPLIFY_UPDATE_AUTH_ALIAS_ATTRIBUTES_WARNING",
      "message": ""
    },
    {
      "id": "COGNITO_SMS_SANDBOX_UPDATE_WARNING",
      "message": "Upgrade to the latest Amplify CLI to enable SMS-based authentication workflows. Run \"amplify upgrade\" or \"npm i -g @aws-amplify/cli\".\r\nStarting June 1, 2021, US telecom carriers require that you register an origination phone number before you can send SMS messages to US phone numbers. The latest version of the Amplify CLI provides a new workflow to accommodate these changes."
    },
    {
      "id": "COGNITO_SMS_SANDBOX_MISSING_PERMISSION",
      "message": "Add permission SNS:GetAccountSandboxStatus permission to see your SNS account mode."
    },
    {
      "id": "COGNITO_SMS_SANDBOX_SANDBOXED_MODE_WARNING",
      "message": "Your SNS account is in Sandbox mode. Your app can only send SMS messages to verified recipient phone numbers.\r\nTo add verified test phone numbers or request to move to production, go to the SNS console: https://console.aws.amazon.com/sns/v3/home#/mobile/text-messaging"
    },
    {
      "id": "COGNITO_SMS_SANDBOX_CATEGORY_AUTH_ADD_OR_UPDATE_INFO",
      "message": "You have enabled SMS based auth workflow. Verify your SNS account mode in the SNS console: https://console.aws.amazon.com/sns/v3/home#/mobile/text-messaging\r\nIf your account is in \"Sandbox\" mode, you can only send SMS messages to verified recipient phone numbers."
    },
    {
      "id": "LAMBDA_LAYER_MIGRATION_WARNING",
      "message": "Amplify has updated the way Lambda layer versions are managed. In order to take advantage of the newest features and bug fixes, a one-way migration is required. All developers and any CI/CD pipelines must upgrade to the latest version of Amplify CLI. Once the layers are migrated, you CANNOT downgrade Amplify CLI below version 5.0.0.\n\nAny update to an existing Lambda layer triggers a migration for that layer upon 'amplify push'."
    }
  ]
}
